ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32630/device/pt_regs.h
/**
 * @file
 * @brief   Type definitions for the Pulse Train Engine.
 *
 */
/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2016-10-10 19:27:24 -0500 (Mon, 10 Oct 2016) $
 * $Revision: 24669 $
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_PT_REGS_H_
#define _MXC_PT_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif


///@cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __RO
#define __RO volatile const
#endif
///@endcond

/**
 * @ingroup     pulsetrain
 * @defgroup    pulsetrain_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions
 * @{
 */

/**
 * Structure type for the Pulse Train Global module registers allowing direct 32-bit access to each register.
 */
typedef struct {
    __IO uint32_t enable;                               /**< <tt>\b 0x0000:</tt> \c PTG_ENABLE Register - Global Enable/Disable Controls for All Pulse Trains. */
    __IO uint32_t resync;                               /**< <tt>\b 0x0004:</tt> \c PTG_RESYNC Register - Global Resync (All Pulse Trains) Control.            */
    __IO uint32_t intfl;                                /**< <tt>\b 0x0008:</tt> \c PTG_INTFL Register - Pulse Train Interrupt Flags.                          */
    __IO uint32_t inten;                                /**< <tt>\b 0x000C:</tt> \c PTG_INTEN Register - Pulse Train Interrupt Enable/Disable.                 */
} mxc_ptg_regs_t;

/**
 * Structure type for the Pulse Train configuration registers allowing direct 32-bit access to each register.
 */
typedef struct {
    __IO uint32_t rate_length;                          /**< <tt>\b 0x0000:</tt>\c PT_RATE_LENGTH Register - Pulse Train Configuration.           */
    __IO uint32_t train;                                /**< <tt>\b 0x0004:</tt>\c PT_TRAIN Register - Pulse Train Output Pattern.                */
    __IO uint32_t loop;                                 /**< <tt>\b 0x0008:</tt>\c PT_LOOP Register - Pulse Train Loop Configuration.             */
    __IO uint32_t restart;                              /**< <tt>\b 0x000C:</tt>\c PT_RESTART Register - Pulse Train Auto-Restart Configuration.  */
} mxc_pt_regs_t;
/**@} end of pulsetrain_registers group*/

/*
   Register offsets for module PT.
*/
/**
 * @ingroup    pulsetrain_registers
 * @defgroup   PTG_Register_Offsets Global Register Offsets
 * @brief      Pluse Train Global Control Register Offsets from the Pulse Train Global Base Peripheral Address.
 * @{
 */
#define MXC_R_PTG_OFFS_ENABLE                               ((uint32_t)0x00000000UL)    /**< Offset from the PTG Base Peripheral Address:<tt>\b 0x0000</tt> */
#define MXC_R_PTG_OFFS_RESYNC                               ((uint32_t)0x00000004UL)    /**< Offset from the PTG Base Peripheral Address:<tt>\b 0x0004</tt> */
#define MXC_R_PTG_OFFS_INTFL                                ((uint32_t)0x00000008UL)    /**< Offset from the PTG Base Peripheral Address:<tt>\b 0x0008</tt> */
#define MXC_R_PTG_OFFS_INTEN                                ((uint32_t)0x0000000CUL)    /**< Offset from the PTG Base Peripheral Address:<tt>\b 0x000C</tt> */
/**@} end of group PTG_Register_Offsets*/
/**
 * @ingroup    pulsetrain_registers
 * @defgroup   PT_Register_Offsets Register Offsets: Configuration
 * @brief      Pluse Train Configuration Register Offsets from the Pulse Train Base Peripheral Address.
 * @{
 */
#define MXC_R_PT_OFFS_RATE_LENGTH                           ((uint32_t)0x00000000UL)    /**< Offset from the PT Base Peripheral Address:<tt>\b 0x0000</tt> */
#define MXC_R_PT_OFFS_TRAIN                                 ((uint32_t)0x00000004UL)    /**< Offset from the PT Base Peripheral Address:<tt>\b 0x0004</tt> */
#define MXC_R_PT_OFFS_LOOP                                  ((uint32_t)0x00000008UL)    /**< Offset from the PT Base Peripheral Address:<tt>\b 0x0008</tt> */
#define MXC_R_PT_OFFS_RESTART                               ((uint32_t)0x0000000CUL)    /**< Offset from the PT Base Peripheral Address:<tt>\b 0x000C</tt> */
/**@} end of group PT_Register_Offsets*/

/*
   Field positions and masks for module PT.
*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_ENABLE_Register PT_ENABLE
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_ENABLE_PT0_POS                             0                                                       /**< PT0 Position */
#define MXC_F_PT_ENABLE_PT0                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT0_POS))   /**< PT0 Mask     */
#define MXC_F_PT_ENABLE_PT1_POS                             1                                                       /**< PT1 Position */
#define MXC_F_PT_ENABLE_PT1                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT1_POS))   /**< PT1 Mask     */
#define MXC_F_PT_ENABLE_PT2_POS                             2                                                       /**< PT2 Position */
#define MXC_F_PT_ENABLE_PT2                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT2_POS))   /**< PT2 Mask     */
#define MXC_F_PT_ENABLE_PT3_POS                             3                                                       /**< PT3 Position */
#define MXC_F_PT_ENABLE_PT3                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT3_POS))   /**< PT3 Mask     */
#define MXC_F_PT_ENABLE_PT4_POS                             4                                                       /**< PT4 Position */
#define MXC_F_PT_ENABLE_PT4                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT4_POS))   /**< PT4 Mask     */
#define MXC_F_PT_ENABLE_PT5_POS                             5                                                       /**< PT5 Position */
#define MXC_F_PT_ENABLE_PT5                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT5_POS))   /**< PT5 Mask     */
#define MXC_F_PT_ENABLE_PT6_POS                             6                                                       /**< PT6 Position */
#define MXC_F_PT_ENABLE_PT6                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT6_POS))   /**< PT6 Mask     */
#define MXC_F_PT_ENABLE_PT7_POS                             7                                                       /**< PT7 Position */
#define MXC_F_PT_ENABLE_PT7                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT7_POS))   /**< PT7 Mask     */
#define MXC_F_PT_ENABLE_PT8_POS                             8                                                       /**< PT8 Position */
#define MXC_F_PT_ENABLE_PT8                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT8_POS))   /**< PT8 Mask     */
#define MXC_F_PT_ENABLE_PT9_POS                             9                                                       /**< PT9 Position */
#define MXC_F_PT_ENABLE_PT9                                 ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT9_POS))   /**< PT9 Mask     */
#define MXC_F_PT_ENABLE_PT10_POS                            10                                                      /**< PT10 Position */
#define MXC_F_PT_ENABLE_PT10                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT10_POS))  /**< PT10 Mask     */
#define MXC_F_PT_ENABLE_PT11_POS                            11                                                      /**< PT11 Position */
#define MXC_F_PT_ENABLE_PT11                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT11_POS))  /**< PT11 Mask     */
#define MXC_F_PT_ENABLE_PT12_POS                            12                                                      /**< PT12 Position */
#define MXC_F_PT_ENABLE_PT12                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT12_POS))  /**< PT12 Mask     */
#define MXC_F_PT_ENABLE_PT13_POS                            13                                                      /**< PT13 Position */
#define MXC_F_PT_ENABLE_PT13                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT13_POS))  /**< PT13 Mask     */
#define MXC_F_PT_ENABLE_PT14_POS                            14                                                      /**< PT14 Position */
#define MXC_F_PT_ENABLE_PT14                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT14_POS))  /**< PT14 Mask     */
#define MXC_F_PT_ENABLE_PT15_POS                            15                                                      /**< PT15 Position */
#define MXC_F_PT_ENABLE_PT15                                ((uint32_t)(0x00000001UL << MXC_F_PT_ENABLE_PT15_POS))  /**< PT15 Mask     */
/**@} PT_ENABLE_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_RESYNC_Register PT_RESYNC
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_RESYNC_PT0_POS                             0                                                       /**< PT0 Position */
#define MXC_F_PT_RESYNC_PT0                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT0_POS))   /**< PT0 Mask     */
#define MXC_F_PT_RESYNC_PT1_POS                             1                                                       /**< PT1 Position */
#define MXC_F_PT_RESYNC_PT1                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT1_POS))   /**< PT1 Mask     */
#define MXC_F_PT_RESYNC_PT2_POS                             2                                                       /**< PT2 Position */
#define MXC_F_PT_RESYNC_PT2                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT2_POS))   /**< PT2 Mask     */
#define MXC_F_PT_RESYNC_PT3_POS                             3                                                       /**< PT3 Position */
#define MXC_F_PT_RESYNC_PT3                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT3_POS))   /**< PT3 Mask     */
#define MXC_F_PT_RESYNC_PT4_POS                             4                                                       /**< PT4 Position */
#define MXC_F_PT_RESYNC_PT4                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT4_POS))   /**< PT4 Mask     */
#define MXC_F_PT_RESYNC_PT5_POS                             5                                                       /**< PT5 Position */
#define MXC_F_PT_RESYNC_PT5                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT5_POS))   /**< PT5 Mask     */
#define MXC_F_PT_RESYNC_PT6_POS                             6                                                       /**< PT6 Position */
#define MXC_F_PT_RESYNC_PT6                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT6_POS))   /**< PT6 Mask     */
#define MXC_F_PT_RESYNC_PT7_POS                             7                                                       /**< PT7 Position */
#define MXC_F_PT_RESYNC_PT7                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT7_POS))   /**< PT7 Mask     */
#define MXC_F_PT_RESYNC_PT8_POS                             8                                                       /**< PT8 Position */
#define MXC_F_PT_RESYNC_PT8                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT8_POS))   /**< PT8 Mask     */
#define MXC_F_PT_RESYNC_PT9_POS                             9                                                       /**< PT9 Position */
#define MXC_F_PT_RESYNC_PT9                                 ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT9_POS))   /**< PT9 Mask     */
#define MXC_F_PT_RESYNC_PT10_POS                            10                                                      /**< PT10 Position */
#define MXC_F_PT_RESYNC_PT10                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT10_POS))  /**< PT10 Mask     */
#define MXC_F_PT_RESYNC_PT11_POS                            11                                                      /**< PT11 Position */
#define MXC_F_PT_RESYNC_PT11                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT11_POS))  /**< PT11 Mask     */
#define MXC_F_PT_RESYNC_PT12_POS                            12                                                      /**< PT12 Position */
#define MXC_F_PT_RESYNC_PT12                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT12_POS))  /**< PT12 Mask     */
#define MXC_F_PT_RESYNC_PT13_POS                            13                                                      /**< PT13 Position */
#define MXC_F_PT_RESYNC_PT13                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT13_POS))  /**< PT13 Mask     */
#define MXC_F_PT_RESYNC_PT14_POS                            14                                                      /**< PT14 Position */
#define MXC_F_PT_RESYNC_PT14                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT14_POS))  /**< PT14 Mask     */
#define MXC_F_PT_RESYNC_PT15_POS                            15                                                      /**< PT15 Position */
#define MXC_F_PT_RESYNC_PT15                                ((uint32_t)(0x00000001UL << MXC_F_PT_RESYNC_PT15_POS))  /**< PT15 Mask     */
/**@} PT_RESYNC_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_INTFL_Register PT_INTFL
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_INTFL_PT0_POS                              0                                                       /**< PT0 Position */
#define MXC_F_PT_INTFL_PT0                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT0_POS))    /**< PT0 Mask     */
#define MXC_F_PT_INTFL_PT1_POS                              1                                                       /**< PT1 Position */
#define MXC_F_PT_INTFL_PT1                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT1_POS))    /**< PT1 Mask     */
#define MXC_F_PT_INTFL_PT2_POS                              2                                                       /**< PT2 Position */
#define MXC_F_PT_INTFL_PT2                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT2_POS))    /**< PT2 Mask     */
#define MXC_F_PT_INTFL_PT3_POS                              3                                                       /**< PT3 Position */
#define MXC_F_PT_INTFL_PT3                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT3_POS))    /**< PT3 Mask     */
#define MXC_F_PT_INTFL_PT4_POS                              4                                                       /**< PT4 Position */
#define MXC_F_PT_INTFL_PT4                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT4_POS))    /**< PT4 Mask     */
#define MXC_F_PT_INTFL_PT5_POS                              5                                                       /**< PT5 Position */
#define MXC_F_PT_INTFL_PT5                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT5_POS))    /**< PT5 Mask     */
#define MXC_F_PT_INTFL_PT6_POS                              6                                                       /**< PT6 Position */
#define MXC_F_PT_INTFL_PT6                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT6_POS))    /**< PT6 Mask     */
#define MXC_F_PT_INTFL_PT7_POS                              7                                                       /**< PT7 Position */
#define MXC_F_PT_INTFL_PT7                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT7_POS))    /**< PT7 Mask     */
#define MXC_F_PT_INTFL_PT8_POS                              8                                                       /**< PT8 Position */
#define MXC_F_PT_INTFL_PT8                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT8_POS))    /**< PT8 Mask     */
#define MXC_F_PT_INTFL_PT9_POS                              9                                                       /**< PT9 Position */
#define MXC_F_PT_INTFL_PT9                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT9_POS))    /**< PT9 Mask     */
#define MXC_F_PT_INTFL_PT10_POS                             10                                                      /**< PT10 Position */
#define MXC_F_PT_INTFL_PT10                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT10_POS))   /**< PT10 Mask     */
#define MXC_F_PT_INTFL_PT11_POS                             11                                                      /**< PT11 Position */
#define MXC_F_PT_INTFL_PT11                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT11_POS))   /**< PT11 Mask     */
#define MXC_F_PT_INTFL_PT12_POS                             12                                                      /**< PT12 Position */
#define MXC_F_PT_INTFL_PT12                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT12_POS))   /**< PT12 Mask     */
#define MXC_F_PT_INTFL_PT13_POS                             13                                                      /**< PT13 Position */
#define MXC_F_PT_INTFL_PT13                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT13_POS))   /**< PT13 Mask     */
#define MXC_F_PT_INTFL_PT14_POS                             14                                                      /**< PT14 Position */
#define MXC_F_PT_INTFL_PT14                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT14_POS))   /**< PT14 Mask     */
#define MXC_F_PT_INTFL_PT15_POS                             15                                                      /**< PT15 Position */
#define MXC_F_PT_INTFL_PT15                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTFL_PT15_POS))   /**< PT15 Mask     */
/**@} PT_INTFL_Register*/
/**
 * @ingroup pulsetrain_registers
 * @defgroup PT_INTEN_Register PT_INTEN
 * @brief Field Positions and Masks
 * @{
 */
#define MXC_F_PT_INTEN_PT0_POS                              0                                                       /**< PT0 Position */
#define MXC_F_PT_INTEN_PT0                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT0_POS))    /**< PT0 Mask     */
#define MXC_F_PT_INTEN_PT1_POS                              1                                                       /**< PT1 Position */
#define MXC_F_PT_INTEN_PT1                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT1_POS))    /**< PT1 Mask     */
#define MXC_F_PT_INTEN_PT2_POS                              2                                                       /**< PT2 Position */
#define MXC_F_PT_INTEN_PT2                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT2_POS))    /**< PT2 Mask     */
#define MXC_F_PT_INTEN_PT3_POS                              3                                                       /**< PT3 Position */
#define MXC_F_PT_INTEN_PT3                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT3_POS))    /**< PT3 Mask     */
#define MXC_F_PT_INTEN_PT4_POS                              4                                                       /**< PT4 Position */
#define MXC_F_PT_INTEN_PT4                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT4_POS))    /**< PT4 Mask     */
#define MXC_F_PT_INTEN_PT5_POS                              5                                                       /**< PT5 Position */
#define MXC_F_PT_INTEN_PT5                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT5_POS))    /**< PT5 Mask     */
#define MXC_F_PT_INTEN_PT6_POS                              6                                                       /**< PT6 Position */
#define MXC_F_PT_INTEN_PT6                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT6_POS))    /**< PT6 Mask     */
#define MXC_F_PT_INTEN_PT7_POS                              7                                                       /**< PT7 Position */
#define MXC_F_PT_INTEN_PT7                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT7_POS))    /**< PT7 Mask     */
#define MXC_F_PT_INTEN_PT8_POS                              8                                                       /**< PT8 Position */
#define MXC_F_PT_INTEN_PT8                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT8_POS))    /**< PT8 Mask     */
#define MXC_F_PT_INTEN_PT9_POS                              9                                                       /**< PT9 Position */
#define MXC_F_PT_INTEN_PT9                                  ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT9_POS))    /**< PT9 Mask     */
#define MXC_F_PT_INTEN_PT10_POS                             10                                                      /**< PT10 Position*/
#define MXC_F_PT_INTEN_PT10                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT10_POS))   /**< PT10 Mask    */
#define MXC_F_PT_INTEN_PT11_POS                             11                                                      /**< PT11 Position*/
#define MXC_F_PT_INTEN_PT11                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT11_POS))   /**< PT11 Mask    */
#define MXC_F_PT_INTEN_PT12_POS                             12                                                      /**< PT12 Position*/
#define MXC_F_PT_INTEN_PT12                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT12_POS))   /**< PT12 Mask    */
#define MXC_F_PT_INTEN_PT13_POS                             13                                                      /**< PT13 Position*/
#define MXC_F_PT_INTEN_PT13                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT13_POS))   /**< PT13 Mask    */
#define MXC_F_PT_INTEN_PT14_POS                             14                                                      /**< PT14 Position*/
#define MXC_F_PT_INTEN_PT14                                 ((uint32_t)(0x00000001UL << MXC_F_PT_INTEN_PT14_POS))   /**< PT14 Mask    */
